import plotly.express as px
import pandas as pd

data = {
    'Año': ['2014'] * 8 + ['2015'] * 8 + ['2016'] * 8 + ['2017'] * 8 + ['2018'] * 8 + ['2019'] * 8 + ['2020'] * 8 + ['2021'] * 8 + ['2022'] * 8 + ['2023'] * 8 + ['2024'] * 8,
    'País': ['Chile', 'Canadá', 'Japón', 'Reino Unido', 'Australia', 'Suiza', 'Polonia', 'Otros'] * 11,
    'Inversión': [
        49745, 26990, 7901, 4228, 4334, 4460, 2332, 4861,
        45489, 16205, 2829, 1316, 7032, 0, 825, 3593,
        34636, 6713, 1199, 1048, 4660, 0, 0, 953,
        42170, 9743, 2059, 1210, 4771, 0, 1100, 3803,
        39385, 13511, 1669, 1233, 4200, 133, 1100, 4518,
        36625, 15157, 0, 7610, 4811, 0, 2000, 6300,
        35880, 17330, 200, 7526, 4811, 0, 2000, 6300,
        35701, 14184, 5720, 3785, 1406, 1541, 1100, 5488,
        36620, 13818, 5533, 3325, 2576, 1848, 1100, 8835,
        35701, 10079, 5057, 3429, 4550, 1795, 1210, 3889,
        53687, 8277, 4709, 3960, 4317, 1869, 1320, 5040
    ]
}

df = pd.DataFrame(data)
fig = px.treemap(df, 
                 path=['Año', 'País'], 
                 values='Inversión', 
                 color='Año', 
                 color_discrete_sequence=px.colors.qualitative.Pastel)
fig.update_layout(title="Inversión en Minería por país origen entre 2014-2024 (MMUS$)", 
                  margin=dict(t=50, l=25, r=25, b=25))
fig.show()
